#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-XzRNKy8UfMULKrDC

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.server.aws_network_interface.netif: Refreshing state... [id=eni-0578126febe81c3d3]
module.server.aws_instance.instance: Refreshing state... [id=i-0527cb6107316545f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.server.aws_instance.instance has changed
  ~ resource "aws_instance" "instance" {
      ~ iam_instance_profile                 = "" -> "AmazonSSMRoleForInstancesQuickSetup"
        id                                   = "i-0527cb6107316545f"
      ~ public_dns                           = "ec2-44-203-82-174.compute-1.amazonaws.com" -> "ec2-3-238-42-18.compute-1.amazonaws.com"
      ~ public_ip                            = "44.203.82.174" -> "3.238.42.18"
        tags                                 = {
            "Name" = "Target Practice"
        }
        # (32 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.api-container.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "api_test"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.api-container.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "api_test"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0545e89a35792bf63",
            ]
          + subnets          = [
              + "subnet-03b71dab2f9a1bb6f",
              + "subnet-072107252df3c7e87",
            ]
        }
    }

  # module.api-container.aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "531133914787.dkr.ecr.us-east-1.amazonaws.com/api-container:latest"
                  + name             = "api_test"
                  + workingDirectory = "/app"
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::531133914787:role/ecsTaskExecutionRole"
      + family                   = "api_test"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.server.aws_instance.instance will be updated in-place
  ~ resource "aws_instance" "instance" {
      - iam_instance_profile                 = "AmazonSSMRoleForInstancesQuickSetup" -> null
        id                                   = "i-0527cb6107316545f"
        tags                                 = {
            "Name" = "Target Practice"
        }
        # (34 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*